[
    {
      "title": "Multilingual Speech Synthesis",
      "imageSrc": "projects/project.png",
      "description": "I developed a speech-to-speech synthesis system that converts English audio into any of 17 different languages while preserving the original voice characteristics. The system utilizes Whisper for highly accurate speech-to-text conversion with 95% translation accuracy. The translated text is then processed using Coqui TTS to regenerate audio, maintaining the original tone and intonation. The system is capable of processing up to 50 audio files per hour, making it both fast and efficient.",
      "skills": ["Python", "Gradio", "Whisper AI", "TTS Synthesis"],
      "demo": "https://huggingface.co/spaces/irmtou/speechtranslationsynthesis1",
      "source": "https://github.com/mt-evan/Speech-Synthesis"
    },
    {
      "title": "Real-Time Auction Marketplace Platform",
      "imageSrc": "projects/project.png",
      "description": "I built a full-stack auction marketplace with real-time bidding, messaging, and transaction management. The frontend uses Next.js 16, React 19, and TypeScript with Tailwind CSS and Radix UI, while a custom WebSocket hook delivers sub-second live auction updates. The backend is powered by FastAPI, SQLAlchemy, and PostgreSQL with connection pooling and SSL, exposing 30+ REST APIs and a WebSocket service organized across 9 data models using a repository pattern. Core features include real-time bidding, direct messaging, notifications, seller ratings, watchlists, and order tracking. The system supports auction-specific WebSocket subscriptions with automatic reconnection and secure JWT authentication with Argon2, and is fully deployed on Railway.",
      "skills": ["FastAPI", "SQLAlchemy ORM", "Python", "Next.js", "TypeScript", "React", "Tailwind CSS", "Radix UI", "PostgreSQL"],
      "source": "https://github.com/SDSU-CompE-561-Fall-2025/the-auction"
    },
    {
      "title": "Meal Tracker and Recommendation System",
      "imageSrc": "projects/project.png",
      "description": "I created a web application that helps users maintain a healthy diet by logging meals and receiving personalized AI-driven meal recommendations. The frontend, built with React and Bootstrap, offers a seamless user experience with sub-200ms response times. The backend, powered by Node.js and Express, efficiently handles thousands of meal entries and user authentication. MongoDB is used for fast data storage and retrieval, while machine learning models developed in Python and TensorFlow analyze meal patterns, achieving 85% recommendation accuracy.",
      "skills": ["React", "Node.js", "Express", "MongoDB", "Bootstrap"],
      "source": "https://github.com/Aakash-Evan/SmartEaterApp"
    },
    {
      "title": "Image Processing Kernels",
      "imageSrc": "projects/project.png",
      "description": "I developed image processing algorithms in MIPS Assembly, including thresholding for image analysis and affine transformations for rotations and shears. Additionally, I implemented cryptographic text blurring using transposition ciphering to enhance data security in image processing. These optimizations led to improved efficiency in image segmentation and transformation, boosting processing speed and accuracy by up to 30%.",
      "skills": ["MIPS Assembley", "MARS", "Matrix Multiplication", "Linear Algebra"],
      "source": "https://github.com/mt-evan/imageProcessingKernels"
    }
  ]