[
    {
      "title": "Multilingual Speech Synthesis",
      "imageSrc": "projects/project.png",
      "description": "This model takes in English audio and outputs it towards the target language while keeping the original voice of the English audio. It turns the original English audio into text using Whisper, then converts the English text into translated text by the translate library, then uses Coqui TTS to convert the translated text into audio.",
      "skills": ["Python", "Gradio", "Whisper AI", "TTS Synthesis"],
      "demo": "https://huggingface.co/spaces/irmtou/speechtranslationsynthesis",
      "source": "https://github.com/mt-evan/Speech-Synthesis"
    },
    {
      "title": "Movie Database",
      "imageSrc": "projects/project.png",
      "description": "Constructed a web app that has access to a database of movies through an OMDb API. It allows the user to search up movies and see the list of results as well as allowing them to view their descriptions, ratings, and film posters.",
      "skills": ["React", "HTML", "CSS", "JavaScript"],
      "demo": "https://searchformovie-db.netlify.app/",
      "source": "https://github.com/mt-evan/movieApp"
    },
    {
      "title": "Grocery List App with Balance Tracker",
      "imageSrc": "projects/project.png",
      "description": "Made a web app that allows a user to make changes to a grocery list that gets updated in real time. In addition, there is a balance tracking system that enables the user to log and delete their transactions to keep track of their EBT (or any card) balance. All information is stored in a Firebase Database and displayed in an organized manner.",
      "skills": ["HTML", "CSS", "JavaScript", "Firebase"],
      "demo": "https://demogrocerylist.netlify.app/",
      "source": "https://github.com/mt-evan/groceryListWithChatbot"
    },
    {
      "title": "Kirby Game",
      "imageSrc": "projects/project.png",
      "description": "Built a 2d-platform game based on the classic Kirby by using TypeScript along with the Kaboom.js library. The level/map was constructed using Tiled. X is jump and Z is the ability.",
      "skills": ["TypeScript", "Kaboom.js", "Tiled"],
      "demo": "https://kirbyclonegame.netlify.app/",
      "source": "https://github.com/mt-evan/KirbyCloneGame"
    },
    {
      "title": "Man City Chrome Extension",
      "imageSrc": "projects/project.png",
      "description": "Allows the user to quickly and convienently check the results of the recent Manchester City matches. Fetches the data from API-SPORTS with JavaScript and displays it with a concise Bootstrap layout. No demo available since I am not registered as a Chrome Web Store Developer.",
      "skills": ["HTML", "Bootstrap", "JavaScript"],
      "source": "https://github.com/mt-evan/mancity-chromeExtension"
    }
  ]